<a href="https://colab.research.google.com/github/sabsabb/Python-Pandas/blob/main/Pandas_07.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Menghapus missing values pada Data Frame**

Import Modules

In [1]:
import pandas as pd

Persiapan Data Frame

In [7]:
df = pd.util.testing.makeMissingDataframe().reset_index()
df.head()

        index         A         B         C         D
0  jH6rXRC6FF  0.010824  0.044598 -1.853515 -0.596254
1  IrvMzpsaGj  1.196200  0.068381 -2.911274 -1.611408
2  yO8tNsfvN8 -0.597172  1.355940  0.966367 -0.216020
3  C80076x5WD -1.273934 -0.708975       NaN  0.730350
4  Dct7wvQYgv       NaN -1.087498 -1.108390  1.173725

In [8]:
df = df.rename(columns={'index':'Z'})
df.head()

            Z         A         B         C         D
0  jH6rXRC6FF  0.010824  0.044598 -1.853515 -0.596254
1  IrvMzpsaGj  1.196200  0.068381 -2.911274 -1.611408
2  yO8tNsfvN8 -0.597172  1.355940  0.966367 -0.216020
3  C80076x5WD -1.273934 -0.708975       NaN  0.730350
4  Dct7wvQYgv       NaN -1.087498 -1.108390  1.173725

In [9]:
df_backup = df.copy(deep=True)

Manghapus Missing Value Pada Kolom

In [10]:
df = df.dropna(axis='columns')
df.head()

            Z
0  jH6rXRC6FF
1  IrvMzpsaGj
2  yO8tNsfvN8
3  C80076x5WD
4  Dct7wvQYgv

Manghapus Missing Value Pada Baris

In [11]:
df = df_backup.copy(deep=True)
df = df.dropna(axis='rows')
df.head()

            Z         A         B         C         D
0  jH6rXRC6FF  0.010824  0.044598 -1.853515 -0.596254
1  IrvMzpsaGj  1.196200  0.068381 -2.911274 -1.611408
2  yO8tNsfvN8 -0.597172  1.355940  0.966367 -0.216020
5  Zjx4FR8YE8  0.344950  1.680791  0.537409 -0.845184
6  5HjmJtD3jT  0.465468 -1.745164  0.543424 -1.955046

Melihat Persentase Missing Value Pada Setiap Kolom

In [12]:
df = df_backup.copy(deep=True)
df.isna().mean()

Z    0.000000
A    0.100000
B    0.133333
C    0.100000
D    0.066667
dtype: float64

Melihat Jumlah Missing Value Pada Setiap Kolom

In [14]:
df.isna().sum()

Z    0
A    3
B    4
C    3
D    2
dtype: int64

Menghapus Missing Value Pada Setiap Kolom Berdasarkan Threshold

In [16]:
#Penentuan ambang batas missing value, jika belum memasuki rentang ambang batas maka kolom tidak akan dihapus
#treshold yang ditetapakn 0.9 atau 90% dimana ambang batas untuk missing value adalah 10%
treshold = len(df)*0.9
df = df.dropna(thresh=treshold, axis='columns')
df.head()

            Z         A         C         D
0  jH6rXRC6FF  0.010824 -1.853515 -0.596254
1  IrvMzpsaGj  1.196200 -2.911274 -1.611408
2  yO8tNsfvN8 -0.597172  0.966367 -0.216020
3  C80076x5WD -1.273934       NaN  0.730350
4  Dct7wvQYgv       NaN -1.108390  1.173725